/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "Secretly utilise le microphone pour les appels audio et vidéo, ainsi que pour enregistrer des messages vocaux.";
"NSCameraUsageDescription" = "Secretly utilise la caméra pour les appels vidéo et pour scanner les codes QR de liaison d’appareils.";
"NSPhotoLibraryUsageDescription" = "Secretly accède à vos photos pour envoyer des images dans les conversations.";
"NSDocumentsFolderUsageDescription" = "Secretly accède à votre dossier Documents pour envoyer des fichiers dans les conversations.";
"NSDownloadsFolderUsageDescription" = "Secretly accède à votre dossier Téléchargements pour enregistrer les fichiers reçus dans les conversations.";
"NSDesktopFolderUsageDescription" = "Secretly accède à votre Bureau pour envoyer des fichiers et des captures d’écran.";
"NSAppleEventsUsageDescription" = "Secretly utilise Apple Events pour s’intégrer aux notifications du système.";
